Repository: sailfishos-mirror/gawk
Catalog: po/*-visual.po
Languages: he

source: from %s
he: %1$s־מ

source: attempt to use a scalar value as array
he: ךרעמכ ראלקסב שומיש ןויסינ

source: attempt to use scalar parameter `%s' as an array
he: ךרעמכ `%1$s' ירלקס הנתשמב שומיש ןויסנ

source: attempt to use scalar `%s' as an array
he: ךרעמכ `%1$s' ראלקסב שומיש ןויסינ

source: attempt to use array `%s' in a scalar context
he: ראלקס לש רשקהב `%1$s' ךרעמב שומיש ןויסנ

source: delete: index `%.*s' not in array `%s'
he: delete: `%2$s' ךרעמב אצמנ אל '%1$.*s` חתפמה

source: attempt to use scalar `%s["%.*s"]' as an array
he: ךרעמכ ']"%2$.*s"[%1$s` ראלקסב שומיש ןויסינ

source: %s: first argument is not an array
he: %1$s: ךרעמ וניא ןושארה טנמוגראה

source: %s: second argument is not an array
he: %1$s: ךרעמ וניא ינש טנמוגרא

source: %s: cannot use %s as second argument
he: %1$s: ינש טנמוגראכ `%2$s'־ב שמתשהל רוסא

source: %s: first argument cannot be SYMTAB without a second argument
he: %1$s: SYMTAB ינש טנמוגרא אלל תויהל לוכי אל ןושאר טנמוגרא

source: %s: first argument cannot be FUNCTAB without a second argument
he: %1$s: FUNCTAB ינש טנמוגרא אלל תויהל לוכי אל ןושאר טנמוגרא

source: asort/asorti: using the same array as source and destination without a third argument is silly.
he: asort/asorti: .ישפיט אוה ישילש טנמוגרא אלל דעיו רוקמכ ךרעמ ותואב שומיש

source: %s: cannot use a subarray of first argument for second argument
he: %1$s: ינש טנמוגרא רובע ןושאר טנמוגרא לש הנשמ ךרעמב שמתשהל לוכי אל

source: %s: cannot use a subarray of second argument for first argument
he: %1$s: ןושאר טנמוגרא רובע ינש טנמוגרא לש הנשמ ךרעמב שמתשהל לוכי אל

source: `%s' is invalid as a function name
he: `%1$s' היצקנופ םשכ יקוח וניא

source: sort comparison function `%s' is not defined
he: תרדגומ הניא `%1$s' ןוימה תייצקנופ

source: %s blocks must have an action part
he: הלועפ תרדגה לולכל בייח %1$s קולב

source: each rule must have a pattern or an action part
he: הלועפ וא תינבת וא היהיש ךירצ קוח לכל

source: old awk does not support multiple `BEGIN' or `END' rules
he: awk BEGIN END וא יקוח המכב ךמות וניא ןשי

source: `%s' is a built-in function, it cannot be redefined
he: `%1$s' התרדגה תא תונשל ןיא ,תינבומ היצקנופ הניה

source: regexp constant `//' looks like a C++ comment, but is not
he: C++, הרעה וניא ךא תפשב הרעה ומכ הארנ `//' ירלוגרה יוטיבה

source: regexp constant `/%s/' looks like a C comment, but is not
he: C, הרעה וניא ךא תפשב הרעה ומכ הארנ `/%1$s/' ירלוגר יוטיב

source: duplicate case values in switch body: %s
he: %1$s :גתמה ףוגב תוישיר יכרע לופכ

source: duplicate `default' detected in switch body
he: default' גותימה ףוגב לופכ` ההוז

source: `break' is not allowed outside a loop or switch
he: break' האלולל ץוחמ`־ב שמתשהל ןיא

source: `continue' is not allowed outside a loop
he: continue' האלולל ץוחמ`־ב שמתשהל ןיא

source: `next' used in %s action
he: next' %1$s לש הלועפ תרדגהב`־ב שומיש

source: `nextfile' used in %s action
he: nextfile' %1$s לש הלועפ תרדגהב`־ב שומיש

source: `return' used outside function context
he: return` היצקנופ לש טסקטנוקב אלש`-ב שומיש

source: plain `print' in BEGIN or END rule should probably be `print ""'
he: `print' BEGIN END print ""'` תויהל םתסה ןמ ךירצ וא יללכב טושפ

source: `delete' is not allowed with SYMTAB
he: `delete' SYMTAB םע רוסא

source: `delete' is not allowed with FUNCTAB
he: `delete' FUNCTAB םע רוסא

source: `delete(array)' is a non-portable tawk extension
he: `delete(array)' tawk ילבטרופ אל לש הבחרה וניה

source: multistage two-way pipelines don't work
he: םידבוע םניא םיבלש יבורמ םיינוויכ־וד םיקיפא

source: concatenation as I/O `>' redirection target is ambiguous
he: I/O `>' יעמשמ דח וניא לש שדחמ בותינ דעיכ רושרשה

source: regular expression on right of assignment
he: ךרע תמשה תארוה לש ןימי דצב ירלוגר יוטיב

source: regular expression on left of `~' or `!~' operator
he: `!~' וא `~' רוטרפואל לאמשמ ירלוגר יוטיב

source: old awk does not support the keyword `in' except after `for'
he: awk in' for'` ירחא טעמל` יוטיבב ךמות אל ןשי

source: regular expression on right of comparison
he: האוושה לש ןימי דצב ירלוגר יוטיב

source: non-redirected `getline' invalid inside `%s' rule
he: `getline' `%1$s' ללכ ךותב יקוח אל בתונמ אל

source: non-redirected `getline' undefined inside END action
he: `getline' END תלועפ ךותב רדגומ וניא היינפה אלל

source: old awk does not support multidimensional arrays
he: awk םידמימ המכ לש םיכרעמב ךמות וניא ןשי

source: call of `length' without parentheses is not portable
he: length' תדיינ הניא םיירגוס ילב`־ל האירק

source: indirect function calls are a gawk extension
he: gawk־ל הבחרה ןניה תויצקנופל תופיקע תואירק

source: cannot use special variable `%s' for indirect function call
he: היצקנופל הפיקע האירק ליבשב `%1$s' דחוימ הנתשמב שמתשהל רוסא

source: attempt to use non-function `%s' in function call
he: היצקנןפ תאורקב `%1$s' היצקנופב אל אוהש רבדב שומיש ןויסנ

source: invalid subscript expression
he: ךרעמ ןייצמב יוגש ריבחת לעב יוטיב

source: warning:
he: :הרהזא

source: fatal:
he: :עירכמ

source: unexpected newline or end of string
he: יופצ-יתלב םוקמב הרוש ףוס

source: source files / command-line arguments must contain complete functions or rules
he: םיללכ וא תואלמ תויצקנופ ליכהל םיבייח הדוקפה תרוש לש םיטנמוגרא / רוקמ יצבוק

source: cannot open source file `%s' for reading: %s
he: %2$s :האירקל `%1$s' רוקמה ץבוק תא חותפל ןתינ אל

source: cannot open shared library `%s' for reading: %s
he: %2$s :האירקל `%1$s' תפתושמה הייקיתה תא חותפל ןתינ אל

source: reason unknown
he: העודי-יתלב הביסמ

source: cannot include `%s' and use it as a program file
he: תינכות ץבוקכ וב שמתשהלו `%1$s' לולכל לוכי אל

source: already included source file `%s'
he: ללכנ רבכ `%1$s' רוקמ ץבוק

source: already loaded shared library `%s'
he: ללכנ רבכ `%1$s' תפתושמ הירפס ץבוק

source: @include is a gawk extension
he: @include gawk־ל תיתדוקנ הבחרה איה

source: empty filename after @include
he: include@ ירחא קיר ץבוק םש

source: @load is a gawk extension
he: @load gawk-ל תיפיצפס הבחרה וניה

source: empty filename after @load
he: load@ ירחא קיר ץבוק םש

source: empty program text on command line
he: הדוקפה תרושמ הלבקתה הקיר תינכת

source: cannot read source file `%s': %s
he: %2$s :`%1$s' רוקמה ץבוק תא אורקל ןתינ אל

source: source file `%s' is empty
he: קיר `%1$s' רוקמה ץבוק

source: error: invalid character '\%03o' in source code
he: \%1$03o' יוגש רוקמה דוקב` ותה :האיגש

source: source file does not end in newline
he: השדח הרושב םייתסמ וניא רוקמה ץבוק

source: unterminated regexp ends with `\' at end of file
he: ץבוקה ףסב '\`-ב םייתסמ רומג-יתלב ירלוגר יוטיב

source: %s: %d: tawk regex modifier `/.../%c' doesn't work in gawk
he: %1$s: %2$d: tawk gawk-ב דבוע אל לש '%3$c/.../` ירלוגר יוטיב הנשמ

source: tawk regex modifier `/.../%c' doesn't work in gawk
he: tawk gawk-ב דבוע אל לש '%1$c/.../` ירלוגר יוטיב הנשמ

source: unterminated regexp
he: רומג-יתלב ירלוגר יוטיב

source: unterminated regexp at end of file
he: ץבוקה ףוסב רומג-יתלב ירלוגר יוטיב

source: use of `\ #...' line continuation is not portable
he: יליבטרופ וניא הרוש ךשמהל ןמיסכ '...# \`-ב שומיש

source: backslash not last character on line
he: הרושב ןורחא ות וניאש ךופה ןסכול

source: multidimensional arrays are a gawk extension
he: gawk לש הבחרה םה םיידממ-בר םיכרעמ

source: POSIX does not allow operator `%s'
he: POSIX `%1$s' רוטרפוא השרמ וניא

source: operator `%s' is not supported in old awk
he: awk ןשי-ב ךמתנ וניא `%1$s' רוטרפוא

source: unterminated string
he: הרומג-יתלב תזורחמ

source: POSIX does not allow physical newlines in string values
he: POSIX תזורחמ יכרעב תויזיפ תושדח תורוש רשפאמ וניא

source: backslash string continuation is not portable
he: יליביטרופ וניא ירוחא יוטנ תזורחמ ךשמה

source: invalid char '%c' in expression
he: יוטיבב '%1$c' יוגש ות

source: `%s' is a gawk extension
he: `%1$s' gawk־ל הבחרה איה

source: POSIX does not allow `%s'
he: POSIX `%1$s' השרמ וניא

source: `%s' is not supported in old awk
he: `%1$s' awk ןשי-ב ךמתנ וניא

source: `goto' considered harmful!
he: `goto' !ינסרה בשחנ

source: %d is invalid as number of arguments for %s
he: %1$d %2$s רובע םיטנמוגרא לש יוגש רפסמ אוה

source: %s: string literal as last argument of substitute has no effect
he: %1$s: העפשה ןיא ףילחת לש ןורחא טנמוגראכ תילולימ תזורחמל

source: %s third parameter is not a changeable object
he: sub' תונשל ןתינש טירפ וניא` לש ישילש %1$s טנמוגרא

source: match: third argument is a gawk extension
he: match' gawk-ל תיפיצפס הבחרה וניה` לש ישילש טנמוגרא

source: close: second argument is a gawk extension
he: close' gawk-ל תיפיצפס הבחרה וניה` לש ינש טנמוגרא

source: use of dcgettext(_"...") is incorrect: remove leading underscore
he: dcgettext("..."): טנמוגרא תמדקבש ןותחת-ףקמ קלסל שי-ב יוגש שומיש

source: use of dcngettext(_"...") is incorrect: remove leading underscore
he: dcngettext("..."): טנמוגרא תמדקבש ןותחת-ףקמ קלסל שי-ב יוגש שומיש

source: index: regexp constant as second argument is not allowed
he: index: רתומ וניא ינש טנמוגראכ ירלוגר יוטיב עובק

source: function `%s': parameter `%s' shadows global variable
he: יללכ הנתשמ לע רבוג `%2$s' רטמרפה :`%1$s' היצקנופה

source: could not open `%s' for writing: %s
he: )%2$s( הלקת הביתכ ךרוצל `%1$s' תחיתפ תעב

source: sending variable list to standard error
he: ינקת תואיגש ץורעל חלשנ םינתשמ תמישר

source: %s: close failed: %s
he: %1$s: %2$s :תריגס תעב הלקת

source: shadow_funcs() called twice!
he: shadow_funcs() !םיימעפ הארקנ

source: there were shadowed variables
he: םיליפאמ םינתשמ ויה

source: function name `%s' previously defined
he: `%1$s' םשב היצקנופ תרדגומ רבכ

source: function `%s': cannot use function name as parameter name
he: רטמרפ םשכ שמשל לוכי וניא היצקנופ םש :`%1$s' היצקנופב

source: function `%s': cannot use special variable `%s' as a function parameter
he: רטמרפ םשכ שמשל לוכי וניא דחוימ הנתשמ םש `%2$s' :`%1$s' היצקנופב

source: function `%s': parameter `%s' cannot contain a namespace
he: םש בחרמ ליכהל לוכי אל `%2$s' רטמרפה :`%1$s' היצקנופה

source: function `%s': parameter #%d, `%s', duplicates parameter #%d
he: %4$d ׳סמ רטמרפ תא לפכשמ ,`%3$s' ,%2$d ׳סמ רטמרפ :`%1$s' היצקנופה

source: function `%s' called but never defined
he: תרדגומ הניאש `%1$s' היצקנופל האירק

source: function `%s' defined but never called directly
he: תארקנ אל ךא ,הרדגוה `%1$s' היצקנופ

source: regexp constant for parameter #%d yields boolean value
he: ינאילוב ךרע בינמ %1$d ׳סמ הנתשמל עובק ירלוגר יוטיב

source: function `%s' called with space between name and `(', or used as a variable or an array
he: n,'(` ןיבל המש ןיב םיחוור םע `%1$s' היצקנןפל האירקךרעמ וא הנתשמכ שמשמ וא

source: division by zero attempted
he: ספאב הקולח ןויסנ

source: division by zero attempted in `%%'
he: `%1$%'-ב ספאב הקולח ןויסנ

source: cannot assign a value to the result of a field post-increment expression
he: הדש לש הלדגה רחאלש יוטיב לש האצותל ךרע תוצקהל ןתינ אל

source: invalid target of assignment (opcode %s)
he: )%1$s דוקפוא( האצקה לש יקוח אל דעי

source: statement has no effect
he: העפשה ןיא הזרכהל

source: identifier %s: qualified names not allowed in traditional / POSIX mode
he: POSIX / יתרוסמ בצמב םירתומ םניא םיכמסומ תומש :%1$s ההזמ

source: identifier %s: namespace separator is two colons, not one
he: דחא אל ,םייתדוקנ ינש אוה תומשה בחרמ דירפמ :%1$s ההזמ

source: qualified identifier `%s' is badly formed
he: היוגש הרוצב רצונ `%1$s' ךמסומ ההזמ

source: identifier `%s': namespace separator can only appear once in a qualified name
he: ךמסומ םשב תחא םעפ קר עיפוהל לוכי תומש בחרמ דירפמ :`%1$s' ההזמ

source: using reserved identifier `%s' as a namespace is not allowed
he: רתומ וניא תומש בחרמכ `%1$s' רומש ההזמב שומיש

source: using reserved identifier `%s' as second component of a qualified name is not allowed
he: השרומ אל אוה ךמסומ םש לש ינש ביכרכ `%1$s' רומש ההזמב שומיש

source: @namespace is a gawk extension
he: @namespace gawk-ל תיפיצפס הבחרה וניה

source: namespace name `%s' must meet identifier naming rules
he: םיהזמ לש תומש ןתמ יללכב דומעל בייח `%1$s' תומשה בחרמ םש

source: %s: called with %d arguments
he: %1$s: םיטנמוגרא %2$d םע ארקנ

source: %s to "%s" failed: %s
he: %1$s %3$s :לקתנ "%2$s"-ל

source: standard output
he: תיטרדנטס טלפ תדיחי

source: standard error
he: תיטרדנטס טלפ תדיחי

source: %s: received non-numeric argument
he: %1$s: רפסמ וניא טנמוגרא

source: exp: argument %g is out of range
he: exp: חווטל ץוחמ %1$g טנמוגראה

source: %s: received non-string argument
he: %1$s: תזורחמ וניא טנמוגרא

source: fflush: cannot flush: pipe `%.*s' opened for reading, not writing
he: fflush: הביתכל אל ,האירקל חותפ `%1$.*s' קיפא :ןקורל ןתינ אל

source: fflush: cannot flush: file `%.*s' opened for reading, not writing
he: fflush: הביתכל אל ,האירקל חותפ `%1$.*s' :ץצוחה ןקורל ןתינ אל

source: fflush: cannot flush file `%.*s': %s
he: fflush: %2$s :`%1$.*s' ץבוק ןקורל ןתינ אל

source: fflush: cannot flush: two-way pipe `%.*s' has closed write end
he: fflush: הביתכה דצ רגס `%1$.*s' ליבקמ ךילהת :ץצוחה ןקורל ןתינ אל

source: fflush: `%.*s' is not an open file, pipe or co-process
he: fflush: `%1$.*s' ליבקמ ךילהת וא חותפ קיפא ,חותפ ץבוק וניא

source: %s: received non-string first argument
he: %1$s: תזורחמ וניאש ןושאר טנמוגרא לבקתה

source: %s: received non-string second argument
he: %1$s: תזורחמ וניא ינש טנמוגרא

source: length: received array argument
he: length: תזורחמ וניא טנמוגרא

source: `length(array)' is a gawk extension
he: `length(array)' gawk-ל תיפיצפס הבחרה וניה

source: %s: received negative argument %g
he: %1$s: %2$g ילילש טנמוגרא םע ארקנ

source: fatal: must use `count$' on all formats or none
he: fatal: count$' דחא ףאב וא םיטמרופה לכב וא רתומ`-ב שומיש

source: field width is ignored for `%%' specifier
he: `%1$%' טרפמ רובע הדשה בחורמ םימלעתמ

source: precision is ignored for `%%' specifier
he: `%1$%' טרפמ רובע קוידהמ םימלעתמ

source: field width and precision are ignored for `%%' specifier
he: `%1$%' טרפמ רובע קוידהו הדשה בחורמ םימלעתמ

source: fatal: `$' is not permitted in awk formats
he: fatal: `$' awk לש םיטמרופב שומישל רוסא

source: fatal: argument index with `$' must be > 0
he: 0־מ לודג תויהל בייח '$` דיל םיטנמוגראה הנומ :עירכמ

source: fatal: argument index %ld greater than total number of supplied arguments
he: fatal: םיטנמוגראה לש ללוכה םרפסממ לודג %1$ld טנמוגראה הנומ

source: fatal: `$' not permitted after period in format
he: fatal: `$' טמרופב הדוקנה ירחא עיפוהל לוכי וניא

source: fatal: no `$' supplied for positional field width or precision
he: fatal: וקויד וא הדש בחור ןייצמב טנמוגראה הנומ רובע '$` אצמנ אל

source: `%c' is meaningless in awk formats; ignored
he: `%1$c' awk; חנזוה לש טמרופב תועמשמ רסח וניה

source: fatal: `%c' is not permitted in POSIX awk formats
he: fatal: `%1$c' awk POSIX יפ-לע לש טמרופב עיפוהל לוכי וניא

source: [s]printf: value %g is too big for %%c format
he: [s]printf: c%% טמרופ רובע ידמ לודג %1$g ךרעה

source: [s]printf: value %g is not a valid wide character
he: [s]printf: יקוח בחר ות וניא %1$g ךרעה

source: [s]printf: value %g is out of range for `%%%c' format
he: [s]printf: `%2$%%c' טמרופ רובע םוחתל ץוחמ אצמנ %1$g ךרעה

source: [s]printf: value %s is out of range for `%%%c' format
he: [s]printf: `%2$%%c' טמרופ רובע חווטל ץוחמ אצמנ %1$s ךרעה

source: %%%c format is POSIX standard but not portable to other awks
he: POSIX awks םירחא-ל דיינ וניא ךא ןקת אוה %1$c%% טמרופ

source: ignoring unknown format specifier character `%c': no argument converted
he: טנמוגרא רמוה אל :עודי אל טמרופ טרפמ לש '%1$c' ותהמ תומלעתה

source: fatal: not enough arguments to satisfy format string
he: fatal: טמרופה רובע םיטנמוגרא קיפסמ ןיא

source: ^ ran out for this one
he: ^ םיטנמוגראה יל ורמגנ ןאכ

source: [s]printf: format specifier does not have control letter
he: [s]printf: הרמהה תרקב תוא ליכמ וניא טמרופה

source: too many arguments supplied for format string
he: טמרופה רובע םיטנמוגרא ידמ רתוי

source: %s: received non-string format string argument
he: %1$s: תזורחמ וניא ןושאר טנמוגרא

source: sprintf: no arguments
he: sprintf: םיטנמוגרא ןיא

source: printf: no arguments
he: printf: טנמוגרא ףא ןיא

source: printf: attempt to write to closed write end of two-way pipe
he: printf: ינוויכ־וד קיפא לש רוגס הביתכ הצקל בותכל ןויסינ

source: %s: received non-numeric third argument
he: %1$s: רפסמ וניא ישילש טנמוגרא

source: %s: received non-numeric second argument
he: %1$s: רפסמ וניא ינש טנמוגרא

source: substr: length %g is not >= 1
he: substr: ספאמ לודג רפסמ ונניא %1$g ךרוא

source: substr: length %g is not >= 0
he: substr: ספאמ לודג רפסמ ונניא %1$g ךרוא

source: substr: non-integer length %g will be truncated
he: substr: ץצוקי ,םלש רפסמ וניאש ,%1$g ךרוא

source: substr: length %g too big for string indexing, truncating to %g
he: substr: %2$g-ל ץצוק ,לודג ידמ רתוי %1$g ךרוא

source: substr: start index %g is invalid, using 1
he: substr: 1-ב ףלחוה ,יוגש וניה %1$g הלחתה ןייצמ

source: substr: non-integer start index %g will be truncated
he: substr: ץצוקי ,םלש רפסמ וניאש, %1$g הלחתה ןייצמ לש וכרע

source: substr: source string is zero length
he: substr: ספא ךרואב הניה רוקמה תזורחמ

source: substr: start index %g is past end of string
he: substr: תזורחמה ףוסל רבעמ וניה %1$g הלחתה ןייצמ

source: substr: length %g at start index %g exceeds length of first argument (%lu)
he: substr: )%3$lu( ןושארה טנמוגרא ךרואמ לודג רתוו %2$g ןייצמב ליחמש %1$g ךרוא

source: strftime: format value in PROCINFO["strftime"] has numeric type
he: strftime: PROCINFO["strftime"] ירפסמ גוסמ אוה תינבתב ךרעה

source: strftime: second argument less than 0 or too big for time_t
he: strftime: 0 time_t רובע ידמ לודג וא-מ ןטק ינש טנמוגרא

source: strftime: second argument out of range for time_t
he: strftime: time_t רובע חווטל ץוחמ ינש טנמוגרא

source: strftime: received empty format string
he: strftime: הקיר טמרופ תזורחמ

source: mktime: at least one of the values is out of the default range
he: mktime: ןוכנה ךוותב וניא םיכרעהמ דחא תוחפל

source: 'system' function not allowed in sandbox mode
he: system' לוח זגרא בצמב הרוסא` תייצקנופ

source: print: attempt to write to closed write end of two-way pipe
he: print: ינוויכ־וד קיפא לש רוגס הביתכ הצקל בותכל ןויסינ

source: reference to uninitialized field `$%d'
he: '%1$d$` לחותאמ-יתלב הדשל הינפה

source: %s: received non-numeric first argument
he: %1$s: רפסמ וניא ןושאר טנמוגרא

source: match: third argument is not an array
he: match: ךרעמ וניא ישילש טנמוגרא

source: %s: cannot use %s as third argument
he: %1$s: ישילש טנמוגראכ %2$s-ב שמתשהל לוכי אל

source: gensub: third argument `%.*s' treated as 1
he: gensub: 1-ב ףלחוה `%1$.*s' ישילש טנמוגרא

source: %s: can be called indirectly only with two arguments
he: %1$s: םיטנמוגרא ינש םע קר ןיפיקעב אורקל ןתינ

source: indirect call to gensub requires three or four arguments
he: gensub םיטנמוגרא העברא וא השולש תשרוד־ל הפיקע האירק

source: indirect call to match requires two or three arguments
he: match םיטנמוגרא השולש וא םיינש תשרוד־ל הפיקע האירק

source: indirect call to %s requires two to four arguments
he: םיטנמוגרא העברא דע םיינש תשרוד %1$s־ל הפיקע האירק

source: lshift(%f, %f): negative values are not allowed
he: lshift(%1$f, %2$f): םירתומ םניא םיילילש םיכרע

source: lshift(%f, %f): fractional values will be truncated
he: lshift(%1$f, %2$f): וצצוקי םירובש םיכרע

source: lshift(%f, %f): too large shift value will give strange results
he: lshift(%1$f, %2$f): תויופצ-יתלב תואצות ביני ידמ לודג הזזה רועיש

source: rshift(%f, %f): negative values are not allowed
he: rshift(%1$f, %2$f): םירתומ םניא םיילילש םיכרע

source: rshift(%f, %f): fractional values will be truncated
he: rshift(%1$f, %2$f): וצצוקי םירובש םיכרע

source: rshift(%f, %f): too large shift value will give strange results
he: rshift(%1$f, %2$f): תויופצ-יתלב תואצות ביני ידמ לודג הזזה רועיש

source: %s: called with less than two arguments
he: %1$s: םיטנמוגרא ינשמ תוחפ םע ארקנ

source: %s: argument %d is non-numeric
he: %1$s: רפסמ וניא %2$d טנמוגרא

source: %s: argument %d negative value %g is not allowed
he: %1$s: רתומ וניא %3$g ילילש ךרע %2$d טנמוגרא

source: compl(%f): negative value is not allowed
he: compl(%1$f): ילילש ךרע רוסא

source: compl(%f): fractional value will be truncated
he: compl(%1$f): ץצוקי רובש ךרע

source: dcgettext: `%s' is not a valid locale category
he: dcgettext:הניקת תוימוקמ תורדגה תיירוגטק הניא `%1$s'

source: %s: received non-string third argument
he: %1$s: תזורחמ וניא ישילש טנמוגרא

source: %s: received non-string fifth argument
he: %1$s: תזורחמ וניא ישימח טנמוגרא

source: %s: received non-string fourth argument
he: %1$s: תזורחמ וניא יעיבר טנמוגרא

source: intdiv: third argument is not an array
he: intdiv: ךרעמ וניא ישילש טנמוגרא

source: intdiv: division by zero attempted
he: intdiv: ספאב הקולח ןויסנ

source: typeof: second argument is not an array
he: typeof: ךרעמ וניא ינשה טנמוגראה

source: typeof detected invalid flags combination `%s'; please file a bug report
he: גאב חוד שיגהל אנ ;`%1$s' ההוזש יקוח אל םילגד בוליש לש גוס

source: typeof: unknown argument type `%s'
he: typeof: `%1$s' עודי אל טנמוגרא גוס

source: cannot add a new file (%.*s) to ARGV in sandbox mode
he: ARGV לוח זגרא בצמב־ל )%1$.*s( שדח ץבוק ףיסוהל ןתינ אל

source: Type (g)awk statement(s). End with the command `end'
he: (g)awk statement(s). end' ` הדוקפב םייסל דילקהל אנ

source: invalid frame number: %d
he: %1$d :יוגש תרגסמ רפסמ

source: info: invalid option - `%s'
he: info: `%1$s' - היוגש תורשפא

source: source: `%s': already sourced
he: source: `%1$s' ארקנ רבכ

source: save: `%s': command not permitted
he: save: `%1$s': השרומ אל הדוקפ

source: cannot use command `commands' for breakpoint/watchpoint commands
he: commands' בקעמ תדוקנ/הריצע תדוקנ תודוקפ רובע` הדוקפב שמתשהל ןתינ אל

source: no breakpoint/watchpoint has been set yet
he: הרימש תדוקנ/הריצע תדוקנ הרדגוה אל ןיידע

source: invalid breakpoint/watchpoint number
he: יקוח אל הרימש תדוקנ/הריצע תדוקנ רפסמ

source: Type commands for when %s %d is hit, one per line.
he: n.הרושב תחא ,%2$d %1$s שחרתמש הרקמל תודוקפ אלמל אנ

source: End with the command `end'
he: end' ` הדוקפה םע םייסל

source: `end' valid only in command `commands' or `eval'
he: `end' commands' eval'` וא` תודוקפב קר ףקת

source: `silent' valid only in command `commands'
he: `silent' commands'` הדוקפב קר רתומ

source: trace: invalid option - `%s'
he: trace: `%1$s' - תיקוח אל תורשפא

source: argument not a string
he: ךרעמ וניא טנמוגראה

source: option: invalid parameter - `%s'
he: option: `%1$s' - יקוח אל רטמרפ

source: no such function - `%s'
he: `%1$s' - תאזכ היצקנופ ןיא

source: enable: invalid option - `%s'
he: enable: `%1$s' - היוגש תורשפא

source: invalid range specification: %d - %d
he: %2$d - %1$d :םיות םוחת לש היוגש הרדגה

source: non-numeric value for field number
he: הדש רפסמ רובע ירפסמ אל ךרע

source: non-numeric value found, numeric expected
he: ירפסמ יופצ ,ירפסמ אל ךרע אצמנ

source: non-zero integer value
he: ספא וניאש םלש רפסמ ךרע

source: backtrace [N] - print trace of all or N innermost (outermost if N < 0) frames
he: backtrace [N] - N N < 0) םא תוינוציחה( רתויב תוימינפה וא תורגסמה לכ לש תובקע ספדה

source: break [[filename:]N|function] - set breakpoint at the specified location
he: break [[filename:]N|ןיוצש םוקימב הריצע תדוקנ רדגה - ]היצקנופ

source: clear [[filename:]N|function] - delete breakpoints previously set
he: clear [[filename:]N|רבעב ורדגוהש הריבש תודוקנ קחמ - ]היצקנופ

source: commands [num] - starts a list of commands to be executed at a breakpoint(watchpoint) hit
he: commands [num] - )הרימש תדוקנ( הריצע תדוקנ עגפב עוציבל תודוקפ לש המישר ליחתמ

source: condition num [expr] - set or clear breakpoint or watchpoint condition
he: condition num [expr] - הרימש תדוקנ בצמ וא הריצע תדוקנ הקנ וא רדגה

source: continue [COUNT] - continue program being debugged
he: continue [תינכותב םיגאב רותיא ךשמה - ]תומכ

source: delete [breakpoints] [range] - delete specified breakpoints
he: delete [וניוצש הריצעה תודוקנ תקיחמ - ]חווט[ ]הריצע תודוקנ

source: disable [breakpoints] [range] - disable specified breakpoints
he: disable [וניוצש הריצעה תודוקנ תתבשה - ]חווט[ ]הריצע תודוקנ
