Repository: sailfishos-mirror/gawk
Catalog: po/*-visual.po
Languages: he

source: close of fd %d (`%s') failed: %s
he: fd %1$d (`%2$s') %3$s :הלשכנ לש הריגסה

source: unnecessary mixing of `>' and `>>' for file `%.*s'
he: `%1$.*s' ץבוק רובע `>>'־ב ןהו `>'־ב ןה רתוימ שומיש

source: redirection not allowed in sandbox mode
he: לוח זגרא בצמב הרוסא הינפה

source: expression in `%s' redirection is a number
he: רפסמ אוה `%1$s' הינפהב יוטיבה

source: expression for `%s' redirection has null string value
he: null/קיר תזורחמ ךרע שי `%1$s' הינפהל יוטיבל

source: filename `%.*s' for `%s' redirection may be result of logical expression
he: יגול יוטיב לש האצות תויהל יושע `%2$s' היינפהל '%1$.*s` ץבוקה םש

source: cannot open pipe `%s' for output: %s
he: %2$s :טלפל `%1$s' קיפאה תא חותפל ןתינ אל

source: cannot open pipe `%s' for input: %s
he: %2$s :טלקל `%1$s' קיפאה תא חותפל ןתינ אל

source: cannot open two way pipe `%s' for input/output: %s
he: %2$s :טלפ/טלקל `%1$s' ינוויכ־וד קיפא חותפל ןתינ אל

source: cannot redirect from `%s': %s
he: %2$s :`%1$s'־מ תונפהל ןתינ אל

source: cannot redirect to `%s': %s
he: %2$s :`%1$s' לא תונפהל ןתינ אל

source: reached system limit for open files: starting to multiplex file descriptors
he: םיצבק ינייצמ בברל ליחתא וישכע :תכרעמה לש םיחותפה םיצבקה תומכ תלבגמל תעגה

source: close of `%s' failed: %s
he: %2$s :הלשכנ `%1$s' לש הריגסה

source: too many pipes or input files open
he: pipes) םיחותפ טלק יצבוק וא( םיקיפא ידמ רתוי

source: close: second argument must be `to' or `from'
he: close' to' from'` וא` תויהל בייח` לש ינשה טנמוגראה

source: close: `%.*s' is not an open file, pipe or co-process
he: close: `%1$.*s' הנשמ ךילהת וא חותפ קיפא ,חותפ ץבוק וניא

source: close of redirection that was never opened
he: םלועמ החתפנ אלש היינפה תריגס

source: close: redirection `%s' not opened with `|&', second argument ignored
he: close: חנזוה ינשה טנמוגראה ,'&|` י"ע החתפנ אל `%1$s' היינפה

source: failure status (%d) on pipe close of `%s': %s
he: %3$s :`%2$s' לש קיפאה תריגס םע )%1$d( לשכ בצמ

source: failure status (%d) on two-way pipe close of `%s': %s
he: %3$s :`%2$s' ינוויכ־וד קיפא תריגס לש )%1$d( לשכ בצמ

source: failure status (%d) on file close of `%s': %s
he: %3$s :`%2$s' לש ץבוקה תריגס לש )%1$d( הלקת בצמ

source: no explicit close of socket `%s' provided
he: socket) שרופמב רגסנ אל( `%1$s' עקש

source: no explicit close of co-process `%s' provided
he: co-process) שרופמב רגסנ אל( `%1$s' ליבקמ ךילהת

source: no explicit close of pipe `%s' provided
he: pipe) שרופמב רגסנ אל( `%1$s' קיפא

source: no explicit close of file `%s' provided
he: שרופמב רגסנ אל `%1$s' ץבוק

source: pipe flush of `%s' failed: %s
he: %2$s :לשכנ `%1$s' קיפאה ץצוח ןוקיר

source: co-process flush of pipe to `%s' failed: %s
he: %2$s :לשכנ `%1$s' לא הנשמ ךילהת קיפא ץצוח ןוקיר

source: file flush of `%s' failed: %s
he: %2$s :לשכנ `%1$s' לש ץבוק ןוקיר

source: local port %s invalid in `/inet': %s
he: /inet':%2$s ` תחת היוגש %1$s תימוקמה החתפה

source: local port %s invalid in `/inet'
he: /inet'`־ב היוגש %1$s תימוקמה החתפה

source: remote host and port information (%s, %s) invalid: %s
he: %3$s :םייוגש )%2$s ,%1$s( םיקחורמה החתפהו חראמה יטרפ

source: remote host and port information (%s, %s) invalid
he: )%2$s ,%1$s( ידילו אל קחורמ בשחמל האיציו םשל עדמ

source: TCP/IP communications are not supported
he: TCP/IP תרושקתב הכימת ןיא

source: could not open `%s', mode `%s'
he: `%2$s' בצמ ,`%1$s' תא חותפל ןתינ אל

source: moving slave pty to stdout in child failed (dup: %s)
he: slave pty stdout )%1$s :לופכש( לשכנ אצאצב־ל תרבעה

source: moving slave pty to stdin in child failed (dup: %s)
he: pty stdin )%1$s :לופכש( הלשכנ אצאצב־ל ףופכ תרבעה

source: could not create child process or open pty
he: pty חותפל וא יאצאצ ךילהת רוציל ןתינ אל

source: moving pipe to stdout in child failed (dup: %s)
he: stdout )%1$s :לופכש( הלשכנ אצאצב־ל קיפא תרבעה

source: moving pipe to stdin in child failed (dup: %s)
he: stdin )%1$s :לופכש( הלשכנ אצאצב־ל קיפאה תרבעה

source: restoring stdout in parent process failed
he: stdout לשכנ הרוה ךילהתב רוזחש

source: restoring stdin in parent process failed
he: stdin הלשכנ הרוהה תינכותב רוזחש

source: `|&' not supported
he: '&|`-ב הכימת ןיא

source: cannot open pipe `%s': %s
he: %2$s :`%1$s' קיפאה תא חותפל ןתינ אל

source: cannot create child process for `%s' (fork: %s)
he: )%2$s :לוציפ( `%1$s' רובע יאצאצ ךילהת רוציל ןתינ אל

source: data file `%s' is empty
he: קיר וניה `%1$s' םינותנ ץבוק

source: could not allocate more input memory
he: טלקל ןורכז רתוי תוצקהל לכי אל

source: multicharacter value of `RS' is a gawk extension
he: RS' gawk-ל תיפיצפס הבחרה הניה` לש ךרעב םיות רפסמב הכימת

source: IPv6 communication is not supported
he: IPv6 תרושקתב הכימת ןיא

source: persistent memory is not supported
he: עובק ןורכיזב הכימת ןיא

source: environment variable `POSIXLY_CORRECT' set: turning on `--posix'
he: POSIXLY_CORRECT' posix'--` ליעפמ :רדגומ` הביבס הנתשמ

source: `--posix' overrides `--traditional'
he: `--posix' traditional'--` לע רבוג

source: `--posix'/`--traditional' overrides `--non-decimal-data'
he: --posix/--traditional' non-decimal-data'--` לע רבוג

source: `--posix' overrides `--characters-as-bytes'
he: `--posix' --characters-as-bytes'` לע רבוג

source: running %s setuid root may be a security problem
he: setuid root עדימ תחטבאב עוגפל הלולע-כ %1$s תצרה

source: cannot set binary mode on stdin: %s
he: stdin): %1$s( ינקתה טלקה לע ירניב בצמ רידגהל ןתינ אל

source: no program text at all!
he: !ללכ אצמנב היה אל תינכת לש טסקט

source: Usage: %s [POSIX or GNU style options] -f progfile [--] file ...
he: GNU POSIX] -f n... ץבןק-םש ]--[ תינכת-םש וא ןונגב םינייפאמ[ %1$s :שומיש ןפוא

source: Usage: %s [POSIX or GNU style options] [--] %cprogram%c file ...
he: GNU POSIX] %2$cn... ץבןק-םש ]--[ %3$cתינכת וא ןונגב םינייפאמ[ %1$s :שומיש ןפוא

source: POSIX options: GNU long options: (standard)
he: POSIX: n)תוליגר( :תוכורא ונג תויורשפא תויורשפא

source: -f progfile --file=progfile
he: -f t --file=nתינכת-ץבורתינכת-ץבוק

source: -F fs --field-separator=fs
he: -F t --field-separator=nתודש-דירפמתודש-דירפמ

source: -v var=val --assign=var=val
he: -v t --assign=nהנתשמ=ךרעהנתשמ=ךרע

source: Short options: GNU long options: (extensions)
he: t\n)תובחרה( :תוחכורא ונג תויורשפא:תורצק תויורשפא

source: -e 'program-text' --source='program-text'
he: -e 't--source='n'תינכות-טסקט'תינכות-טסקט

source: -E file --exec=file
he: -E t --exec=nץבוק-םשץבוק-םש

source: To report bugs, use the `gawkbug' program. For full instructions, see the node `Bugs' in `gawk.info' which is section `Reporting Problems and Bugs' in the printed version. This same information may be found at https://www.gnu.org/software/gawk/manual/html_node/Bugs.html. PLEASE do NOT try to report bugs by posting in comp.lang.awk, or by using a web forum such as Stack Overflow.
he: gawkbug'. ` תינכותב שמתשהל אנ ,תולקת לע חוודל ידכBugs' gawk.info' `־ב` ףיעסל תונפל בטומ תואלמ תויחנהלReporting Problems and Bugs' nהסרגב` ךותמ ףיעס־תת אוהשnרתאב םג אוצמל רשפא עדימה ותוא תא .תספדומהhttps://www.gnu.org/software/gawk/manual/html_node/Bugs.html. comp.lang.awk, ־ב תולקת לע חוודל אל אנStack Overflow. תמגודכ םינווקמ םימורופב וא

source: Source code for gawk may be obtained from %s/gawk-%s.tar.gz
he: gawk nךרד גישהל רשפא לש רוקמה דוק תא%1$s/gawk-%2$s.tar.gz

source: gawk is a pattern scanning and processing language. By default it reads standard input and writes standard output.
he: gawk n.תוינבת לש דוביעו הקירסל הפש איהstdin) stdout). ( ינקתה טלפל תבתוכו( ינקתה טלקהמ תארוק איה לדחמ תרירבכ

source: Examples: %s '{ sum += $1 }; END { print sum }' file %s -F: '{ print $1 }' /etc/passwd
he: n:תואמגוד %1$s '{ sum += $1 }; END { print sum }' file %1$s -F: '{ print $1 }' /etc/passwd

source: Copyright (C) 1989, 1991-%d Free Software Foundation. This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version.
he: C) 1989,1991-%1$d n.תישפוחה הנכותה ןרקל ( תורומש תויוכזה לכ nותוא תונשל וא/ו שדחמ התוא ץיפהל רשפא ,תישפוח הנכות וזnהנכותה ןרק ידי לע םסרופמש יפכ ונג לש יללכה ירוביצה ןוישירל ףופכב3 nתינכדע הסרג לכ )ךלוקישל( וא ןוישירה לש הסרגב תישפוחהn.ולש רתוי

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
he: nךא תלעות איבתש הווקתב תצפומ תאזה תינכותהnשומישל תזמורמ אל וליפא ,תוירחא המע תאשונ הניאnירוביצה ןוישירב .תמיוסמ תילכתל המאתה וא ירחסמn.דוע ךכ לע דומלל רשפא ונג לש יללכה

source: You should have received a copy of the GNU General Public License along with this program. If not, see http://www.gnu.org/licenses/.
he: GNU General Public License; לש קתועב הוולמ תויהל הרומא וז תינכתsee http://www.gnu.org/licenses/. ואר אנא ,ותוא םתלביק אל םא

source: -Ft does not set FS to tab in POSIX awk
he: -Ft FS TAB POSIX awk לש תסרגב תויהל-ל םרוג וניא

source: %s: `%s' argument to `-v' not in `var=value' form
he: %1$s: v' var=value' ` לש הרוצב וניא-` היצפואל `%2$s' טנמוגרא

source: `%s' is not a legal variable name
he: `%1$s' יקוח הנתשמ םש וניא

source: `%s' is not a variable name, looking for file `%s=%s'
he: `%1$s' `%2$s=%s' ץבוקה רחא שופיח עצבתמ ,הנתשמ םש אל אוה

source: cannot use gawk builtin `%s' as variable name
he: gawk הנתשמ םשכ־ב הנבומש `%1$s' םשב שמתשהל ןתינ אל

source: cannot use function `%s' as variable name
he: הנתשמ םשכ `%1$s' היצקנופב שמתשהל ןתינ אל

source: floating point exception
he: הפצ הדוקנ יבושיחב הגירח

source: fatal error: internal error
he: תקלה חמורה: שגיאת תכנה פנימית

source: fatal error: internal error: segfault
he: segfault :תימינפ הנכת תאיגש :הרומח הלקת

source: fatal error: internal error: stack overflow
he: stack overflow :תימינפ הנכת תאיגש :הרומח הלקת

source: no pre-opened fd %d
he: שארמ חותפ אל %1$d טלפ/טלק ץורע

source: could not pre-open /dev/null for fd %d
he: dev/null %1$d ץבוק-וייפאמ-ל/ טלפ/טלק ץורע חותפל ןתינ אל

source: empty argument to `-e/--source' ignored
he: e/--source' חנזוה-`-ל קיר טנמוגרא

source: `--profile' overrides `--pretty-print'
he: `--profile' pretty-print'--` לע רבוג

source: Persistent memory is not supported.
he: .עובק ןורכיזב הכימת ןיא

source: %s: option `-W %s' unrecognized, ignored
he: %1$s: -W %2$s' nתחספנ ,תרכומ הניא` תורשפאה

source: %s: option requires an argument -- %c
he: %1$s n%2$c -- טנמוגרא בייחמ ןייפאמ

source: PREC value `%.*s' is invalid
he: PRECיוגש `%1$.*s' ־ה ךרע

source: ROUNDMODE value `%.*s' is invalid
he: ROUNDMODE `%1$.*s' יוגש־ה ךרע

source: atan2: received non-numeric first argument
he: atan2: רפסמ וניא ןושאר טנמוגרא

source: atan2: received non-numeric second argument
he: atan2: רפסמ וניא ינש טנמוגרא

source: %s: received negative argument %.*s
he: %1$s: %2$.*s ילילש טנמוגרא לביק

source: int: received non-numeric argument
he: int: רפסמ וניא טנמוגרא

source: compl: received non-numeric argument
he: compl: רפסמ וניא טנמוגרא

source: compl(%Rg): negative value is not allowed
he: compl(%1$Rg): ילילש ךרע רוסא

source: comp(%Rg): fractional value will be truncated
he: comp(%1$Rg): ץצוקי ינורשע רבש םע ךרע

source: compl(%Zd): negative values are not allowed
he: compl(%1$Zd): םיילילש םיכרע רוסא

source: %s: received non-numeric argument #%d
he: %1$s: %2$d ׳סמ ירפסמ וניאש טמוגרא לבקתה

source: and: called with less than two arguments
he: and: םיטנמוגרא ינשמ תוחפ םע ארקנ

source: or: called with less than two arguments
he: or: םיטנמוגרא ינשמ תוחפ םע ארקנ

source: xor: called with less than two arguments
he: xor: םיטנמוגרא ינשמ תוחפ םע ארקנ

source: srand: received non-numeric argument
he: srand: רפסמ וניא טנמוגרא

source: intdiv: received non-numeric first argument
he: intdiv: ירפסמ וניאש ןושאר טנמוגרא לביק

source: intdiv: received non-numeric second argument
he: intdiv: ירפסמ וניאש ינש טנמוגרא לביק

source: old awk does not support the `\%c' escape sequence
he: awk '%1$c\` הרקב תורדסב ךמות וניא ןשי

source: POSIX does not allow `\x' escapes
he: POSIX x'\` גוסמ הרקב תורדס השרמ וניא ןקת

source: no hex digits in `\x' escape sequence
he: x'\` הרקב תרדסב תוילמיצדסקה תורפס ןיא

source: hex escape \x%.*s of %d characters probably not interpreted the way you expect
he: x%1$.*s' םיפצמ םתאש ומכ ןבומ היהי אל םיבת %2$d לש\` הרקב תרדסש תויהל לוכי

source: escape sequence `\%c' treated as plain `%c'
he: \%1$c' טושפ `%2$c' לש סחיל הכוז` טולימה ות

source: Invalid multibyte data detected. There may be a mismatch between your data and your locale
he: תורדגההו ךלש םינותנה ןיב המאתה יא שיש הארנכ .םייוגש םיתב יבורמ םינותנ והוזךלש תוימוקמה

source: %s %s `%s': could not get fd flags: (fcntl F_GETFD: %s)
he: %1$s %2$s `%3$s': fcntl F_GETFD: %4$s)( :ץבוק ןייפאמ לש היצפוא תאצוהב הלקת

source: %s %s `%s': could not set close-on-exec: (fcntl F_SETFD: %s)
he: %1$s %2$s `%3$s': close-on-exec fcntl ( :ץבוק ןייפאמ לע לש היצפוא םישהל הלועפב הלקתF_GETFD: %1$s)

source: Program indentation level too deep. Consider refactoring your code
he: ךלש דוקב םיינבמ םייוניש עצבל לוקשל יאדכ .ידמ הקומע תינכותה לש ןוניקה תמר

source: sending profile to standard error
he: ינקת תואיגש ץורעל חלשנ עוציב ליפורפ

source: # %s rule(s)
he: # n%1$s יללכ

source: # Rule(s)
he: # n)םי(ללכ

source: internal error: %s with null vname
he: vname ספואמ ולש-הש %1$s :תימינפ הנכת תאיגש

source: internal error: builtin with null fname
he: fname null)( קיר םע הנבומ :תימינפ האיגש

source: # gawk profile, created %s
he: # gawk n%1$s ךיראתמ לש ליפורפ

source: # Functions, listed alphabetically
he: # nתיב-ףלא רדסב ,תויצקנופ

source: redir2str: unknown redirection type %d
he: redir2str: עודי אל %1$d הינפהה גוס

source: invalid NUL byte in dynamic regexp
he: NULL) ימניד ירלוגר יוטיבב( ספואמ תיב

source: regexp escape sequence `\%c' treated as plain `%c'
he: \%1$c' טושפ `%2$c'־כ חנעופ ירלוגרה יוטיבה לש` טולימה ףצר

source: regexp escape sequence `\%c' is not a known regexp operator
he: \%1$c' םיירלוגר םייוטיב לש תרכומ הלועפ ונניא` םיירלוגרה םייוטיבה טולימ ףצר

source: regexp component `%.*s' should probably be `[%.*s]'
he: [%2$.*s]'` תויהל רומא הארנכ '%1$.*s` ירלוגרה יוטיבה ביכר

source: unbalanced [
he: ] ןזואמ אל

source: invalid character class
he: היוגש םיוות תקלחמ

source: character class syntax is [[:space:]], not [:space:]
he: space:]], space:]:[ אל:[[ אוה םיוות תקלחמ ריבחת

source: unfinished \ escape
he: יקלח \ טולימ

source: ? at start of expression
he: ? יוטיב תליחתב

source: * at start of expression
he: * יוטיב תליחתב

source: + at start of expression
he: + יוטיב תליחתב

source: {...} at start of expression
he: {...} יוטיבה תליחתב

source: invalid content of \{\}
he: יוגש }\{\ ןכות

source: regular expression too big
he: ידמ לודג ירלוגרה יוטיבה

source: stray \ before unprintable character
he: \ הגצהל וניאש ות ינפל העות

source: stray \ before white space
he: \ חוור ינפל העות

source: stray \ before %lc
he: \ %1$lc ינפל העות

source: stray \
he: \ העות

source: unbalanced (
he: ) ןזואמ אל

source: no syntax specified
he: ריבחת ןיוצ אל

source: unbalanced )
he: ( ןזואמ אל

source: %s: option '%s' is ambiguous; possibilities:
he: %1$s: :תויורשפא ,תיעמשמ־דח הניא '%2$s' תורשפאה

source: %s: option '--%s' doesn't allow an argument
he: %1$s: --%2$s' nטנמוגראב שמתשהל השרמ אל' תורשפאה

source: %s: option '%c%s' doesn't allow an argument
he: %1$s: nטנמוגרא לבקמ וניא '%3$s%2$c' ןייפאמ

source: %s: option '--%s' requires an argument
he: %1$s: nטנמוגרא בייחמ '%2$s--' ןייפאמ

source: %s: unrecognized option '--%s'
he: %1$s: n'%2$s--' ההוזמ-יתלב ןייפאמ

source: %s: unrecognized option '%c%s'
he: %1$s: n'%3$s%2$c' ההוזמ-יתלב ןייפאמ

source: %s: invalid option -- '%c'
he: %1$s: n'%2$c' -- יוגש ןייפאמ

source: %s: option requires an argument -- '%c'
he: %1$s: n'%2$c' -- טנמוגרא בייחמ ןייפאמ

source: %s: option '-W %s' is ambiguous
he: %1$s: W %2$s' nיעמשמ-דח וניא-' ןייפאמ

source: %s: option '-W %s' doesn't allow an argument
he: %1$s: -W %2$s' nטנמוגרא השרמ אל' תורשפאה

source: %s: option '-W %s' requires an argument
he: %1$s: W %2$s' nטנמוגרא בייחמ-' ןייפאמ

source: Success
he: החלצה

source: No match
he: המיאתמ תזורחמ האצמנ אל

source: Invalid regular expression
he: יוגש ירלוגר יוטיב

source: Invalid collation character
he: רדגומ-יתלב רודיס ות

source: Invalid character class name
he: םיות תצובק לש רדגומ-יתלב םש

source: Trailing backslash
he: '\` ירוחא ןסכולב םייתסמ ירלוגר יוטיב

source: Invalid back reference
he: םדוק יוטיב-תתל היוגש היינפה

source: Unmatched [, [^, [:, [., or [=
he: [, [^, [:, [., גוז ינב םהל ןיאש =[ וא

source: Unmatched ( or \(
he: ( גוז-ןב ול ןיאש (\ וא

source: Unmatched \{
he: \{ גוז-ןב ול ןיאש

source: Invalid content of \{\}
he: }\{\ ךותב יוגש הנבמ

source: Invalid range end
he: םיות םוחת לש היוגש הרדגה

source: Memory exhausted
he: ןורכזה רמגנ

source: Invalid preceding regular expression
he: םייק וניא וא יוגש םדוק ירלוגר יוטיב

source: Premature end of regular expression
he: ידמ םדקומ םייתסמ ירלוגר יוטיב

source: Regular expression too big
he: ידמ בכרומ וא לודג ירלוגר יוטיב

source: Unmatched ) or \)
he: ) גוז-ןב ול ןיאש )\ וא

source: No previous regular expression
he: םדוק ירלוגר יוטיב ןיא

source: current setting of -M/--bignum does not match saved setting in PMA backing file
he: -M/--bignum PMA־ה יוביג ץבוקב הרמשנש הרדגהל תמאות אל לש תיחכונה הרדגהה

source: function `%s': cannot use function `%s' as a parameter name
he: רטמרפ םשכ `%2$s' היצקנופב שמתשהל ןתינ אל :`%1$s' היצקנופה

source: cannot pop main context
he: pop) ישארה ןכותה תא( ףולשל ןתינ אל
