Repository: sailfishos-mirror/gawk
Catalog: po/*-visual.po
Languages: he

source: display [var] - print value of variable each time the program stops
he: display [תרצענ תינכותהש םעפ לכב הנתשמ לש ךרע תספדה - ]הנתשמ

source: down [N] - move N frames down the stack
he: down [המירעה דרומב תורגסמ ש לש הדירי - ]ש

source: dump [filename] - dump instructions to file or stdout
he: dump [stdout־ל וא ץבוקל תויחנהה תלטה - ]ץבוק םש

source: enable [once|del] [breakpoints] [range] - enable specified breakpoints
he: enable [once|del] [תומיוסמ הריצע תודוקנ תלעפה - ]חווט[ ]הריצע תודוקנ

source: end - end a list of commands or awk statements
he: end - awk לש תורהצה וא תודוקפ תמישר ףוס

source: eval stmt|[p1, p2, ...] - evaluate awk statement(s)
he: eval stmt|[p1, p2, ...] - awk ייוטיב בושיח

source: exit - (same as quit) exit debugger
he: exit - (quit) תואיגשה הפנממ האיצי ומכ

source: finish - execute until selected stack frame returns
he: finish - תרזוח תרחבנה תינסחמה תרגסמש דע ץירהל

source: frame [N] - select and print stack frame number N
he: frame [ש ׳סמ תרגסמ לש הספדהו הריחב - ]ש

source: help [command] - print list of commands or explanation of command
he: help [הדוקפ לש רבסה וא תודוקפ תמישר תספדה - ]הדוקפ

source: ignore N COUNT - set ignore-count of breakpoint number N to COUNT
he: ignore N COUNT - N COUNT ידכל הריצעה תדוקנ לש תומלעתה תומכ תרדגה

source: list [-|+|[filename:]lineno|function|range] - list specified line(s)
he: list [-|+|[filename:]lineno|function|range] - וניוצש תורושה תגצה

source: next [COUNT] - step program, proceeding through subroutine calls
he: next [תורגש־תתל תאירקל דעבמ תומדקתה ךות ,תינכותב הדיעצ - ]תומכ

source: nexti [COUNT] - step one instruction, but proceed through subroutine calls
he: nexti [תורגשה־תתל תואירקל דעבמ ךישמהל לבא ,תחא היחנהב תומדקתה - ]תומכ

source: option [name[=value]] - set or display debugger option(s)
he: option [name[=value]] - תואיגש הפנמ תויורשפא תגצה וא תרדגה

source: print var [var] - print value of a variable or array
he: print var [ךרעמ וא הנתשמ לש ךרע תגצה - ]הנתשמ

source: printf format, [arg], ... - formatted output
he: printf format, [arg], ... - בצועמ טלפ

source: quit - exit debugger
he: quit - תואיגשה הפנממ האיצי

source: return [value] - make selected stack frame return to its caller
he: return [הל ארקש ימל רוזחל תרחבנה המירעה תרגסמל םורגל - ]ךרע

source: run - start or restart executing program
he: run - תינכות תצרה שודיח וא תלחתה

source: save filename - save commands from the session to file
he: save filename - ץבוקל הלעפההמ תודוקפ תרימש

source: set var = value - assign value to a scalar variable
he: set var = value - יראלקס הנתשמל ךרע תלחה

source: silent - suspends usual message when stopped at a breakpoint/watchpoint
he: silent - בקעמ/הריצע תדוקנ לע הריצע ןמזב תוליגרה תועדוהה בוכיע

source: source file - execute commands from file
he: ץבוקמ תודוקפ תצרה -- רוקמ ץבוק

source: step [COUNT] - step program until it reaches a different source line
he: step [COUNT] - תרחא רוקמ תרושל העגהל דע תינכותב דעצ דעצ רובעל

source: stepi [COUNT] - step one instruction exactly
he: stepi [דבלב תחא היחנה םדקתהל - ]תומכ

source: tbreak [[filename:]N|function] - set a temporary breakpoint
he: tbreak [[filename:]N|function] - תינמז הריצע תדוקנ תרדגה

source: trace on|off - print instruction before executing
he: trace on|off - התצרה ינפל היחנהה תא סיפדהל

source: undisplay [N] - remove variable(s) from automatic display list
he: undisplay [N] - תיטמוטוא הגוצת תמישרמ םינתשמ תרסה

source: until [[filename:]N|function] - execute until program reaches a different line or line N within current frame
he: until [[filename:]N|function] - הרושל וא תרחא תרושל העיגמ תינכותהש דע ץירהלN תיחכונה תרגסמב

source: unwatch [N] - remove variable(s) from watch list
he: unwatch [N] - בקעמה תמישרמ םינתשמ תרסה

source: up [N] - move N frames up the stack
he: up [N] - N המישרה הלעמב תורגסמ תאלעה

source: watch var - set a watchpoint for a variable
he: watch var - הנתשמל בקעמ תדוקנ תרדגה

source: where [N] - (same as backtrace) print trace of all or N innermost (outermost if N < 0) frames
he: where [N] - (backtrace) N N < 0) םא תוינוציחה( רתויב תוימינפה וא תורגסמה לכ לש תובקע ספדה-ל ההז

source: error:
he: :האיגש

source: cannot read command: %s
he: n%1$s :הדוקפ אורקל ןתינ אל

source: cannot read command: %s
he: %1$s :הדוקפ אורקל ןתינ אל

source: invalid character in command
he: הדוקפב יקוח אל ות

source: unknown command - `%.*s', try help
he: help הסנ ,`%1$.*s' - העודי אל הדוקפ

source: invalid character
he: יוגש ות

source: undefined command: %s
he: n%1$s :תרדגומ אל הדוקפ

source: set or show the number of lines to keep in history file
he: הירוטסיהה ץבוקב רומשל שיש תורושה רפסמ תא גצה וא רדגה

source: set or show the list command window size
he: המישרה תדוקפ ןולח לדוג תא גצה וא רדגה

source: set or show gawk output file
he: gawk טלפ ץבוק גצה וא רדגה

source: set or show debugger prompt
he: םיגאב יופינ תעדוה תגצה וא הרדגה

source: (un)set or show saving of command history (value=on|off)
he: (on|off)=ךרע( תודוקפה תיירוטסיה תרימש תגצה וא הרדגה )לוטיב

source: (un)set or show saving of options (value=on|off)
he: (on|off)=ךרע( תויצפוא תרימש תגצה וא תרדגה )לוטיב

source: (un)set or show instruction tracing (value=on|off)
he: (on|off)=ךרע( תוארוה רחא בקעמ תגצה וא הרדגה )לוטיב

source: program not running
he: תלעופ אל תינכותה

source: source file `%s' is empty.
he: n.קיר וניה `%1$s' רוקמ ץבוק

source: no current source file
he: יחכונ רוקמ ץבוק ןיא

source: cannot find source file named `%s': %s
he: %2$s :`%1$s' םשב רוקמ ץבוק אוצמל לוכי אל

source: warning: source file `%s' modified since program compilation.
he: n.תינכותה רודיה זאמ הנתשה `%1$s' רוקמה ץבוק :הרהזא

source: line number %d out of range; `%s' has %d lines
he: תורוש %3$d שי `%2$s' -ל ;חווטל ץוחמ %1$d רפסמ הרוש

source: unexpected eof while reading file `%s', line %d
he: eof %2$d הרוש ,`%1$s' ץבוקה תאירק ןמזב יופצ אל

source: source file `%s' modified since start of program execution
he: תינכותה תצרה תליחת זאמ ךרענ `%1$s' רוקמה ץבוק

source: Current source file: %s
he: n%1$s :יחכונה רוקמה ץבוק

source: Number of lines: %d
he: n%1$d :תורושה רפסמ

source: Source file (lines): %s (%d)
he: n)%2$d( %1$s :)תורוש( רוקמ ץבוק

source: Number Disp Enabled Location
he: nםוקמ ?ליעפ הגוצת רפסמ

source: number of hits = %ld
he: n%1$ld = תודיכלה רפסמ

source: ignore next %ld hit(s)
he: nתואבה תועיגפה %1$ %ld ־מ תומלעתה

source: stop condition: %s
he: n%1$s :הריצע יאנת

source: commands:
he: n:תודוקפ

source: Current frame:
he: :תיחכונ תרגסמ

source: Called by frame:
he: :תרגסמ ידי לע ארקנ

source: Caller of frame:
he: :תרגסמל ארוק

source: None in main().
he: main(). ־ב ןיא

source: No arguments.
he: n.םיטנמוגרא ןיא

source: No locals.
he: n.םיימוקמ םינתשמ ןיא

source: All defined variables:
he: n:םירדגומה םינתשמה לכ

source: All defined functions:
he: n:תורדגומה תויצקנופה לכ

source: Auto-display variables:
he: n:תיטמוטוא םינתשמ תגצה

source: Watch variables:
he: n:םינתשמ רחא בקעמ

source: no symbol `%s' in current context
he: nיחכונה רשקהב `%1$s' למס ןיא

source: `%s' is not an array
he: `%1$s' nךרעמ וניא

source: $%ld = uninitialized field
he: $%1$ld = nלחתואמ אל הדש

source: array `%s' is empty
he: nקיר `%1$s' ךרעמה

source: subscript "%.*s" is not in array `%s'
he: n`%2$s' ךרעמב וניא ”%1$.*s„ חתפמה

source: `%s["%.*s"]' is not an array
he: `%1$s["%.*s"]' nךרעמ וניא

source: `%s' is not a scalar variable
he: `%1$s' ירלקס הנתשמ וניא

source: attempt to use array `%s["%.*s"]' in a scalar context
he: ראלקס שרודה רשקהב `%1$s["%.*s"]' ךרעמב שומיש ןויסנ

source: attempt to use scalar `%s["%.*s"]' as array
he: ךרעמכ `%1$s["%.*s"]' ראלקסב שמתשהל ןויסינ

source: `%s' is a function
he: `%1$s' היצקנופ איה

source: watchpoint %d is unconditional
he: nםיאנת תלוטנ %1$d בקעמה תדוקנ

source: no display item numbered %ld
he: %1$ld רפסמה םע הגוצת טירפ ןיא

source: no watch item numbered %ld
he: %1$ld רפסמה םע בקעמ טירפ ןיא

source: %d: subscript "%.*s" is not in array `%s'
he: %1$d: n`%3$s' ךרעמב וניא ”%2$.*s„ חתפמה

source: attempt to use scalar value as array
he: ךרעמכ יראלקס ךרעב שמתשהל ןויסינ

source: Watchpoint %d deleted because parameter is out of scope.
he: n.חווטב וניא הנתשמה יכ הקחמנ %1$d בקעמה תדוקנ

source: Display %d deleted because parameter is out of scope.
he: n.חווטל ץוחמ הנתשמהש ןוויכ הקחמנ %1$d הגוצתה

source: in file `%s', line %d
he: n%2$d הרוש ,`%1$s' ץבוקב

source: at `%s':%d
he: %2$d:`%1$s'־ב

source: #%ld in
he: t ־ב%1$ld ׳סמ

source: More stack frames follow ...
he: n…ךשמהב המירע תורגסמ דוע

source: invalid frame number
he: יוגש תרגסמה רפסמ

source: Breakpoint %d set at file `%s', line %d
he: n%3$d הרוש ,`%2$s' ץבוקב הרדגוה %1$d הריצעה תדוקנ

source: cannot set breakpoint in file `%s'
he: n`%1$s' ץבוקב הריצע תדוקנ רידגהל ןתינ אל

source: line number %d in file `%s' is out of range
he: םוחתל ץוחמ איה `%2$s' ץבוקב %1$d רפסמ הרוש

source: internal error: cannot find rule
he: nללכה תא אוצמל ןתינ אל :תימינפ האיגש

source: cannot set breakpoint at `%s':%d
he: n%2$d:`%1$s'־ב הריצע תדוקנ רידגהל ןתינ אל

source: cannot set breakpoint in function `%s'
he: n`%1$s'־ב הריצע תדוקנ רידגהל ןתינ אל

source: line number %d in file `%s' out of range
he: חווטל ץוחמ איה `%2$s' ץבוקב %1$d ׳סמ הרוש

source: Deleted breakpoint %d
he: %1$d הריצע תדוקנ תקיחמ

source: No breakpoint at file `%s', line #%d
he: n%2$d ׳סמ הרוש ,`%1$s' ץבוקב הריצע תדוקנ ןיא

source: invalid breakpoint number
he: יוגש הריצעה תדוקנ רפסמ

source: Delete all breakpoints? (y or n)
he: y n) וא( ?הריצעה תודוקנ לכ תא קוחמל

source: y
he: כ

source: Restarting ...
he: n…שדחמ לעפומ

source: Failed to restart debugger
he: הלשכנ שדחמ תואיגשה הפנמ תלעפה

source: Program already running. Restart from beginning (y/n)?
he: y/n)? ( הלחתההמ ליחתהל .הליעפ רבכ תינכותה

source: Program not restarted
he: nשדחמ הלעפוה אל תינכותה

source: error: cannot restart, operation not allowed
he: nתישרומ אל הלועפה ,הלחתההמ ליעפהל ןתינ אל :האיגש

source: error (%s): cannot restart, ignoring rest of the commands
he: nתומלעתהל וכזי תודוקפה ראש ,שדחמ ליעפהל ןתינ אל :)%1$s( האיגש

source: Starting program:
he: n:תלעפומ תינכותה

source: Program exited abnormally with exit value: %d
he: n%1$d :האיציה ךרע םע גירח ןפואב העטקנ תינכותה

source: Program exited normally with exit value: %d
he: n%1$d :האיציה ךרע םע ליגרכ האצי תינכותה

source: The program is running. Exit anyway (y/n)?
he: y/n)? ( תאז לכב תאצל .הליעפ תינכותה

source: Not stopped at any breakpoint; argument ignored.
he: n.חספנ טנמוגראה ,הריצע תדוקנ ףאב רצענ אל

source: invalid breakpoint number %d
he: יוגש %1$d הריצעה תדוקנ רפסמ

source: Run until return from
he: ־מ הרזח דע ץורל

source: invalid source line %d in file `%s'
he: `%2$s' ץבוקב היוגש %1$d רוקמה תרוש

source: cannot find specified location %d in file `%s'
he: n`%2$s' ץבוקב %1$d ןיוצש םוקמה תא אוצמל ןתינ אל

source: element not in array
he: nךרעמב אל ביכרה

source: untyped variable
he: nגוס אלל הנתשמ

source: ------[Enter] to continue or [q] + [Enter] to quit------
he: ------[Enter] q] Enter] ------תאצל ידכ[ זאו[ וא ךישמהל ידכ

source: ["%.*s"] not in array `%s'
he: ["%1$.*s"] `%2$s' ךרעמב אל

source: sending output to stdout
he: stdout ־ל חלשנ טלפ

source: invalid number
he: יוגש רפסמ

source: fatal error during eval, need to restart.
he: eval (nשדחמ ליעפהל שי ,)הכרעה ךלהמב תיתוהמ האיגש

source: no symbol `%s' in current context
he: יחכונה רשקהב `%1$s' לומיס ןיא

source: unknown nodetype %d
he: nodetype %1$d רכומ אל

source: unknown opcode %d
he: opcode %1$d רכומ אל

source: opcode %s not an operator or keyword
he: opcode %1$s רכומ אל

source: buffer overflow in genflags2str
he: genflags2str-ב ץצוח תשילג

source: # Function Call Stack:
he: # n:תויצקנופל תואירקה תינסחמ

source: `IGNORECASE' is a gawk extension
he: `IGNORECASE' gawk-ל תיפיצפס הבחרה וניה

source: `BINMODE' is a gawk extension
he: `BINMODE' gawk-ל תיפיצפס הבחרה וניה

source: BINMODE value `%s' is invalid, treated as 3
he: BINMODE 3-ב םישמתשמ ,ןוכנ וניא-ל `%1$s' ךרע

source: bad `%sFMT' specification `%s'
he: `%2$s' םוגפ `%1$sFMT' טרפמ

source: turning off `--lint' due to assignment to `LINT'
he: lint' LINT''-ל ךרע תמשה בקע--` לטבמ

source: reference to uninitialized argument `%s'
he: `%1$s' לחתואמ יתלב טנמוגראל הינפה

source: reference to uninitialized variable `%s'
he: `%1$s' לחתואמ-יתלב הנתשמל הינפה

source: attempt to field reference from non-numeric value
he: רפסמ וניאש ךרע תועצמאב הדשל הינפה ןויסנ

source: attempt to field reference from null string
he: הקיר תזורחמ תועצמאב הדשל הינפה ןויסנ

source: attempt to access field %ld
he: %1$ld הדשל השיג ןויסינ

source: reference to uninitialized field `$%ld'
he: '%1$ld$` לחתואמ יתלב הדשל הינפה

source: function `%s' called with more arguments than declared
he: וזרכוהשמ םיטנמוגרא רתוי םע הארקנ `%1$s' היצקנופה

source: unwind_stack: unexpected type `%s'
he: unwind_stack: יופצ יתלב `%1$s' גוס

source: division by zero attempted in `/='
he: '=/`־ב ספאב הקולח ןויסינ

source: division by zero attempted in `%%='
he: `%1$%='-ב ספאב הקולח ןויסינ

source: extensions are not allowed in sandbox mode
he: לוח זגרא בצמב תורוסא תובחרה

source: -l / @load are gawk extensions
he: -l / @load gawk לש תובחרה ןה

source: load_ext: received NULL lib_name
he: load_ext: NULL lib_name רותב לביק

source: load_ext: cannot open library `%s': %s
he: load_ext: %2$s :`%1$s' הירפסה תא חותפל ןתינ אל

source: load_ext: library `%s': cannot call function `%s': %s
he: load_ext: %3$s :`%2$s' היצקנופל אורקל הלוכי אל :`%1$s' היירפסה

source: load_ext: library `%s' initialization routine `%s' failed
he: load_ext: הלשכנ `%2$s' היירפסה לש `%1$s' לוחתאה תרגש

source: make_builtin: missing function name
he: make_builtin: רסח היצקנופה םש

source: make_builtin: cannot use gawk built-in `%s' as function name
he: make_builtin: gawk היצקנופ םשכ־ב הנבומה `%1$s' םשב שמתשהל ןתינ אל

source: make_builtin: cannot use gawk built-in `%s' as namespace name
he: make_builtin: gawk בחרמ םשכ־ב הנבומה `%1$s' םשב שמתשהל ןתינ אל

source: make_builtin: cannot redefine function `%s'
he: make_builtin: שדחמ `%1$s' היצקנופה תא רידגהל ןתינ אל

source: make_builtin: function `%s' already defined
he: make_builtin: תרדגומ רבכ `%1$s' היצקנופה

source: make_builtin: function name `%s' previously defined
he: make_builtin: רבעב רדגוה רבכ `%1$s' היצקנופה םש

source: make_builtin: negative argument count for function `%s'
he: make_builitn: `%1$s': ילילש םיטנמוגרא רפסמ

source: function `%s': argument #%d: attempt to use scalar as an array
he: ךרעמכ ראלקסב שמתשהל ןויסינ :%2$d ׳סמ טנמוגרא :`%1$s' היצקנופ

source: function `%s': argument #%d: attempt to use array as a scalar
he: רלאקסכ ךרעמב שמתשהל ןויסינ :%2$d ׳סמ טנמוגרא :`%1$s' היצקנופ

source: dynamic loading of libraries is not supported
he: תימניד תוירפס תניעטב הכימת ןיא

source: stat: unable to read symbolic link `%s'
he: stat: `%1$s' ילמסה רושיקה תא אורקל ןתינ אל

source: stat: first argument is not a string
he: stat: תזורחמ וניא ןושארה טנמוגראה

source: stat: second argument is not an array
he: stat: ךרעמ וניא ינשה טנמוגראה

source: stat: bad parameters
he: stat: םייוגש םירטמרפ

source: fts init: could not create variable %s
he: fts init: %1$s הנתשמה תא רוציל ןתינ אל

source: fts is not supported on this system
he: fts תאזה תכרעמב־ב הכימת ןיא

source: fill_stat_element: could not create array, out of memory
he: fill_stat_element: ןורכיזה רמגנ ,ךרעמ רוציל ןתינ אל

source: fill_stat_element: could not set element
he: fill_stat_element: ביכר רידגהל ןתינ אל

source: fill_path_element: could not set element
he: fill_path_element: ביכר רידגהל ןתינ אל

source: fill_error_element: could not set element
he: fill_error_element: ביכר רידגהל ןתינ אל

source: fts-process: could not create array
he: fts-process: ךרעמ רוציל ןתינ אל

source: fts-process: could not set element
he: fts-process: ביכר רידגהל ןתינ אל

source: fts: called with incorrect number of arguments, expecting 3
he: fts: 3 תויהל םירומא ,םיטנמוגרא לש היוגש תומכ םע ארקנ

source: fts: first argument is not an array
he: fts: ךרעמ וניא ןושאר טנמוגרא

source: fts: second argument is not a number
he: fst: רפסמ וניא ינשה טנמוגראה

source: fts: third argument is not an array
he: fts: ךרעמ וניא ישילשה טנמוגראה

source: fts: could not flatten array
he: fts: nךרעמה תא חטשל ןתינ אל

source: fnmatch: could not get first argument
he: fnmatch: ןושארה טנמוגראה תא לבקל ןתינ אל

source: fnmatch: could not get second argument
he: fnmatch: ינשה טנמוגראה תא לבקל ןתינ אל

source: fnmatch: could not get third argument
he: fnmatch: ישילשה טנמוגראה תא לבקל ןתינ אל

source: fnmatch is not implemented on this system
he: fnmatch nתאזה תכרעמב שמוממ אל

source: fnmatch init: could not add FNM_NOMATCH variable
he: fnmatch init: FNM_NOMATCH הנתשמה תא ףיסוהל ןתינ אל

source: fnmatch init: could not set array element %s
he: fnmatch init: %1$s ךרעמב ביכר רידגהל ןתינ אל

source: fnmatch init: could not install FNM array
he: fnmatch init: FNM ךרעמ ןיקתהל ןתינ אל

source: fork: PROCINFO is not an array!
he: fork:PROCINFO !ךרעמ וניא

source: inplace::begin: expects 2 arguments but called with %d
he: inplace::begin: 2 %1$d םע ארקנ לבא םיטנמוגרא־ל הפצמ

source: inplace::begin: cannot retrieve 1st argument as a string filename
he: inplace::begin: תזורחמ ץבוק םשכ ןושאר טנמוגרא לבקל ןתינ אל

source: inplace::begin: `%s' is not a regular file
he: inplace::begin:ליגר ץבוק וניא `%1$s'

source: inplace::begin: mkstemp(`%s') failed (%s)
he: inplace::begin:mkstemp(`%1$s') )%2$s( לשכנ

source: inplace::begin: chmod failed (%s)
he: inplace::begin:chmod )%1$s( לשכנ

source: inplace::begin: dup(stdout) failed (%s)
he: inplace::begindup(stdout) )%1$s( הלשכנ :

source: inplace::begin: dup2(%d, stdout) failed (%s)
he: inplace::begindup2(%1$d, stdout) )%2$s( הלשכנ :

source: inplace::begin: close(%d) failed (%s)
he: inplace::begin:close(%1$d) )%2$s( הלשכנ

source: inplace::end: expects 2 arguments but called with %d
he: inplace::end: 2 %1$d םע ארקנ לבא םיטנמוגרא־ל הפצמ

source: inplace::end: cannot retrieve 1st argument as a string filename
he: inplace::end: תזורחמ ץבוק םשכ ןושאר טנמוגרא לבקל ןתינ אל

source: inplace::end: dup2(%d, stdout) failed (%s)
he: inplace::end:dup2(%1$d, stdout) )%2$s( הלשכנ

source: inplace::end: close(%d) failed (%s)
he: inplace::end:close(%1$d) )%2$s( הלשכנ

source: inplace::end: fsetpos(stdout) failed (%s)
he: inplace::endfsetpos(stdout) )%1$s( הלשכנ :

source: inplace::end: link(`%s', `%s') failed (%s)
he: inplace::end:link(`%1$s', `%2$s') )%3$s( הלשכנ

source: ord: first argument is not a string
he: ord: תזורחמ וניא ןושארה טנמוגראה

source: chr: first argument is not a number
he: chr: רפסמ וניא ןושארה טנמוגראה

source: readfile: called with wrong kind of argument
he: readfile: יוגש טנמוגרא גוס םע ארקנ

source: %s: first argument is not a string
he: %1$s: תזורחמ וניא ןושארה טנמוגראה

source: writea: second argument is not an array
he: writea: ךרעמ וניא ינשה טנמוגראה

source: write_array: could not release flattened array
he: write_array: חטשוהש ךרעמ ררחשל ןתינ אל

source: array value has unknown type %d
he: %1$d עודי אל ךרעמה ךרע גוס

source: rwarray extension: received GMP/MPFR value but compiled without GMP/MPFR support.
he: rwarray: GMP/MPFR GMP/MPFR .־ב הכימת אלל עצוב רודיהה לבא ךרע לבקתה תבחרה

source: cannot free number with unknown type %d
he: %1$d עודי אל גוסמ רפסמ ררחשל ןתינ אל

source: cannot free value with unhandled type %d
he: %1$d לפוטמ אל גוסמ ךרע ררחשל ןתינ אל

source: readall: unable to set %s::%s
he: readall: %2$s::%1$s רידגהל ןתינ אל

source: readall: unable to set %s
he: readall: %1$s רידגהל ןתינ אל

source: reada: clear_array failed
he: reada:clear_array לשכנ

source: reada: second argument is not an array
he: reada: ךרעמ וניא ינשה טנמוגראה

source: read_array: set_array_element failed
he: read_array:set_array_element לשכנ

source: gettimeofday: not supported on this platform
he: gettimeofday: תאזה המרופטלפב ךמתנ אל

source: sleep: missing required numeric argument
he: sleep: יחרכה ירפסמ טנמוגרא רסח

source: sleep: argument is negative
he: sleep: ילילש טנמוגראה

source: sleep: not supported on this platform
he: sleep: תאזה המרופטלפב ךמתנ אל

source: strptime: called with no arguments
he: strptime: םיטנמוגרא אלל ארקנ

source: do_strptime: argument 1 is not a string
he: do_strptime: 1 nתזורחמ וניא טנמוגרא

source: do_strptime: argument 2 is not a string
he: do_strptime: 2 nתזורחמ וניא טנמוגרא

source: input record too large
he: ידמ הלודג טלקה תמושר

source: NF set to negative value
he: NF ילילש ךרעל רדגוה

source: decrementing NF is not portable to many awk versions
he: NF awk תואסרג לש בחר ןווגמב תכמתנ הניא תנטקה

source: accessing fields from an END rule may not be portable
he: END awk לש םירחא םישומימב דבוע דימת אל ללכמ תודשל השיג

source: split: fourth argument is a gawk extension
he: split: gawk לש הבחרה אוה יעיברה טנמוגראה

source: split: fourth argument is not an array
he: split: ךרעמ וניא יעיברה טנמוגראה

source: %s: cannot use %s as fourth argument
he: %1$s: יעיבר טנמוגראכ %2$s־ב שמתשהל ןתינ אל

source: split: second argument is not an array
he: split: ךרעמ וניא ינשה טנמוגראה

source: split: cannot use the same array for second and fourth args
he: split: יעיברהו ינשה םיטנמוגראל ךרעמה ותואב שמתשהל ןתינ אל

source: split: cannot use a subarray of second arg for fourth arg
he: split: יעיברה טנמוגראה רותב ינשה טנמוגראה לש ךרעמ־תתב שמתשהל רוסא

source: split: cannot use a subarray of fourth arg for second arg
he: split: ינש טנמוגראכ יעיברה טנמוגראה לש ךרעמ־תתב שמתשהל רוסא

source: split: null string for third arg is a non-standard extension
he: split' gawk־ל תיתדוקנ הבחרה איה`־ל ישילש טנומגראכ תספואמ תזורחמ

source: patsplit: fourth argument is not an array
he: patsplit: ךרעמ וניא יעיברה טנמוגראה

source: patsplit: second argument is not an array
he: patsplit: ךרעמ וניא ינשה טנמוגראה

source: patsplit: third argument must be non-null
he: patsplit: קיר ראשיהל לוכי אל ישילשה טנמוגראה

source: patsplit: cannot use a subarray of fourth arg for second arg
he: patsplit'`־ל יעיברו ינש םיטנמוגראכ ךרעמ ותואב שמתשהל רוסא

source: `FIELDWIDTHS' is a gawk extension
he: `FIELDWIDTHS' gawk לש הבחרה איה

source: `*' must be the last designator in FIELDWIDTHS
he: `*' FIELDWIDTHS ()תודומע יבחור־ב ןורחאה דירפמה תויהל בייח

source: invalid FIELDWIDTHS value, for field %d, near `%s'
he: FIELDWIDTHS, `%2$s'־ל בורק ,%1$d הדשל־ל יוגש ךרע

source: null string for `FS' is a gawk extension
he: FS' gawk־ל הבחרה איה`־כ תספואמ תזורחמ

source: old awk does not support regexps as value of `FS'
he: awk FS'` לש ךרעכ םיירלוגר םייוטיבב ךמות אל ןשי

source: `FPAT' is a gawk extension
he: `FPAT' gawk לש הבחרה איה

source: awk_value_to_node: received null retval
he: awk_value_to_node: null)( קיר הרזחה ךרע לבקתה

source: awk_value_to_node: not in MPFR mode
he: awk_value_to_node: MPFR בצמב אל

source: awk_value_to_node: MPFR not supported
he: awk_value_to_node: MPFR־ב הכימת ןיא

source: awk_value_to_node: invalid number type `%d'
he: awk_value_to_node: יוגש `%1$d' רפסמה גוס

source: add_ext_func: received NULL name_space parameter
he: add_ext_func: name_space (NULL)( קיר )םש בחרמ הנתשמ לבקתה

source: node_to_awk_value: detected invalid numeric flags combination `%s'; please file a bug report
he: node_to_awk_value: הלקתכ ךכ לע חוודל אנ ,`%1$s' יוגש םינולגד בוליש הלגתה

source: node_to_awk_value: received null node
he: node_to_awk_value: null)( קיר קרפמ לבקתה

source: node_to_awk_value: received null val
he: node_to_awk_value: null)( קיר ךרע לבקתה

source: remove_element: received null array
he: remove_element: קיר ךרעמ לבקתה

source: api_get_mpfr: MPFR not supported
he: api_get_mpfr: MPFR־ב הכימת ןיא

source: cannot find end of BEGINFILE rule
he: BEGINFILE ללכ ףוס תא אוצמל ןתינ אל

source: cannot open unrecognized file type `%s' for `%s'
he: `%2$s' רובע `%1$s' רכומ יתלבה ץבוקה גוס תא חותפל ןתינ אל

source: command line argument `%s' is a directory: skipped
he: חספנ :הייקית אוה `%1$s' הדוקפה תרוש טנמוגרא

source: cannot open file `%s' for reading: %s
he: %2$s :האירקל `%1$s' ץבוקה תא חותפל ןתינ אל
